# CannotDeletePredefinedFamilyElement Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EditingFailures..::..CannotDeletePredefinedFamilyElement Property
BuiltInFailures..::..EditingFailures Class See Also
---
Element is a built-in part of the family definition and cannot be deleted or added to groups.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotDeletePredefinedFamilyElement { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotDeletePredefinedFamilyElement As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotDeletePredefinedFamilyElement {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EditingFailures Class
Autodesk.Revit.DB Namespace